app/Controllers/Profilecontroller.php

SELECT `c`.*, `tc`.`short_name` as `country_name`, `tc2`.`short_name` as `billing_country_name`, `tc3`.`short_name` as `shipping_country_name`
FROM `tblclients` `c`
LEFT JOIN `tblcountries` `tc` ON `tc`.`country_id`  = `c`.`country`
LEFT JOIN `tblcountries` `tc2` ON `tc2`.`country_id` = `c`.`billing_country`
LEFT JOIN `tblcountries` `tc3` ON `tc3`.`country_id` = `c`.`shipping_country`
WHERE `c`.`userid` = '4'
---
    public function getProfile()
    {
        $contactId = $this->request->getGet('contact_id');

        if (empty($contactId)) {
            return $this->fail('contact_id requis', 400);
        }

        $contactModel = new ContactModel();
        $contact = $contactModel->find($contactId);

        if (!$contact) {
            return $this->fail('Contact introuvable', 404);
        }

        // Récupérer la société liée avec les noms de pays
        $db = \Config\Database::connect();
        $client = $db->table('tblclients c')
            ->select('c.*,
                      tc.short_name  as country_name,
                      tc2.short_name as billing_country_name,
                      tc3.short_name as shipping_country_name')
            ->join('tblcountries tc',  'tc.country_id  = c.country',          'left')
            ->join('tblcountries tc2', 'tc2.country_id = c.billing_country',  'left')
            ->join('tblcountries tc3', 'tc3.country_id = c.shipping_country', 'left')
            ->where('c.userid', $contact['userid'])
            ->get()
            ->getRowArray();

SELECT `country_id`, `short_name`
FROM `tblcountries`
ORDER BY `short_name` ASC
---
    public function getCountries()
    {
        $db = \Config\Database::connect();
        $countries = $db->table('tblcountries')
            ->select('country_id, short_name')
            ->orderBy('short_name', 'ASC')
            ->get()
            ->getResultArray();