app/Controllers/Profilecontroller.php

SELECT *
FROM `tblclients`
WHERE `userid` = '1'
---
    public function getProfile()
    {
        $contactId = $this->request->getGet('contact_id');

        if (empty($contactId)) {
            return $this->fail('contact_id requis', 400);
        }

        $contactModel = new ContactModel();
        $contact = $contactModel->find($contactId);

        if (!$contact) {
            return $this->fail('Contact introuvable', 404);
        }

        // Récupérer la société liée
        $db = \Config\Database::connect();
        $client = $db->table('tblclients')
            ->where('userid', $contact['userid'])
            ->get()
            ->getRowArray();

SELECT *
FROM `tblclients`
WHERE `userid` = '2'
---
    public function updateCompany()
    {
        $data      = $this->request->getJSON(true);
        $contactId = $data['contact_id'] ?? null;

        if (empty($contactId)) {
            return $this->fail('contact_id requis', 400);
        }

        $contactModel = new ContactModel();
        $contact = $contactModel->find($contactId);

        if (!$contact) {
            return $this->fail('Contact introuvable', 404);
        }

        $db     = \Config\Database::connect();
        $client = $db->table('tblclients')->where('userid', $contact['userid'])->get()->getRowArray();

UPDATE `tblclients` SET `company` = 'stn', `vat` = '', `phonenumber` = '59786410', `country` = '1', `city` = '', `zip` = '', `state` = '', `address` = '', `website` = ''
WHERE `userid` = '2'
---
            return $this->fail('Aucune donnée à mettre à jour', 400);
        }

        $db->table('tblclients')->where('userid', $contact['userid'])->update($updateData);