app/Controllers/ProposalController.php

SELECT `id`, `userid`, `firstname`, `lastname`, `email`, `phonenumber`, `title`, COALESCE(is_primary, 0) AS is_primary
FROM `tblcontacts`
WHERE `userid` = 4
ORDER BY `is_primary` DESC, `firstname` ASC
SELECT `userid`, `company` AS `name`, `email` AS `client_email`, `phonenumber` AS `client_phone`
FROM `tblclients`
WHERE `userid` = 4
---
    public function contacts()
    {
        $clientId = (int) $this->request->getGet('client_id');
        if (!$clientId) return $this->fail('client_id requis', 400);

        $db = \Config\Database::connect();

        // Récupérer les contacts sans filtrer sur 'active' (peut être NULL dans Perfex)
        $contacts = $db->table('tblcontacts')
            ->select('id, userid, firstname, lastname, email, phonenumber, title,
                      COALESCE(is_primary, 0) AS is_primary')
            ->where('userid', $clientId)
            ->orderBy('is_primary', 'DESC')
            ->orderBy('firstname',  'ASC')
            ->get()->getResultArray();

        // Récupérer aussi les infos du client (fallback si 0 contacts)
        $client = $db->table('tblclients')
            ->select('userid, company AS name, email AS client_email, phonenumber AS client_phone')
            ->where('userid', $clientId)
            ->get()->getRowArray();

SELECT `id`, `name`, `symbol`, `isdefault`
FROM `tblcurrencies`
ORDER BY `isdefault` DESC
---
    public function currencies()
    {
        $db = \Config\Database::connect();
        $currencies = $db->table('tblcurrencies')
            ->select('id, name, symbol, isdefault')
            ->orderBy('isdefault', 'DESC')
            ->get()->getResultArray();

SELECT *
FROM `tblcontacts`
WHERE `id` = 11
AND `active` = 1
---
    public function clientList()
    {
        $contactId = (int) $this->request->getGet('contact_id');
        if (!$contactId) return $this->fail('contact_id requis', 400);

        $db      = \Config\Database::connect();
        $contact = $db->table('tblcontacts')
            ->where('id', $contactId)->where('active', 1)->get()->getRowArray();

SELECT `staffid` AS `id`, `firstname`, `lastname`, `email`
FROM `tblstaff`
WHERE `active` = 1
ORDER BY `firstname` ASC
---
    public function staffList()
    {
        $db    = \Config\Database::connect();
        $staff = $db->table('tblstaff')
            ->select('staffid AS id, firstname, lastname, email')
            ->where('active', 1)
            ->orderBy('firstname', 'ASC')
            ->get()->getResultArray();