app/Controllers/TicketController.php

SELECT COUNT(*) AS `numrows`
FROM `tbltickets`
WHERE `status` = 2
SELECT COUNT(*) AS `numrows`
FROM `tbltickets`
WHERE `status` = 3
---
    public function staffList()
    {
        $statusFilter = $this->request->getGet('status');
        $db = \Config\Database::connect();

        $summary = [
            'ouvert'   => $db->table('tbltickets')->where('status', 1)->countAllResults(),
            'en_cours' => $db->table('tbltickets')->where('status', 2)->countAllResults(),
            'ferme'    => $db->table('tbltickets')->where('status', 3)->countAllResults(),

SELECT `t`.*, `ts`.`name` as `status_name`, `ts`.`statuscolor`, `tp`.`name` as `priority_name`, `td`.`name` as `department_name`
FROM `tbltickets` `t`
LEFT JOIN `tbltickets_status` `ts` ON `ts`.`ticketstatusid` = `t`.`status`
LEFT JOIN `tbltickets_priorities` `tp` ON `tp`.`priorityid` = `t`.`priority`
LEFT JOIN `tbldepartments` `td` ON `td`.`departmentid` = `t`.`department`
WHERE `t`.`ticketid` = '1'
SELECT `r`.*
FROM `tblticket_replies` `r`
WHERE `r`.`ticketid` = '1'
ORDER BY `r`.`date` ASC
SELECT *
FROM `tblticket_attachments`
WHERE `replyid` = '1'
---
    public function detail($ticketId = null)
    {
        if (!$ticketId) return $this->fail('ticket_id requis', 400);

        $db = \Config\Database::connect();

        $ticket = $db->table('tbltickets t')
            ->select('t.*, ts.name as status_name, ts.statuscolor,
                      tp.name as priority_name, td.name as department_name')
            ->join('tbltickets_status ts',     'ts.ticketstatusid = t.status',    'left')
            ->join('tbltickets_priorities tp', 'tp.priorityid = t.priority',      'left')
            ->join('tbldepartments td',        'td.departmentid = t.department',  'left')
            ->where('t.ticketid', $ticketId)
            ->get()->getRowArray();

        if (!$ticket) return $this->fail('Ticket introuvable', 404);

        // Réponses avec pièces jointes
        $replies = $db->table('tblticket_replies r')
            ->select('r.*')
            ->where('r.ticketid', $ticketId)
            ->orderBy('r.date', 'ASC')
            ->get()->getResultArray();

        // Ajouter les pièces jointes à chaque réponse
        foreach ($replies as &$reply) {
            $reply['attachments'] = $db->table('tblticket_attachments')
                ->where('replyid', $reply['id'])
                ->get()->getResultArray();

SELECT *
FROM `tblticket_attachments`
WHERE `ticketid` = '1'
AND replyid IS NULL
UPDATE `tbltickets` SET `clientread` = 1
WHERE `ticketid` = '1'
---
        unset($reply);

        // Pièces jointes du message initial (replyid = NULL, ticketid = X)
        $ticket['attachments'] = $db->table('tblticket_attachments')
            ->where('ticketid', $ticketId)
            ->where('replyid IS NULL', null, false)
            ->get()->getResultArray();

        $db->table('tbltickets')->where('ticketid', $ticketId)->update(['clientread' => 1]);