app/Models/ProposalModel.php

SELECT *
FROM `tblitemable`
WHERE `rel_id` = 3
AND `rel_type` = 'proposal'
ORDER BY `item_order` ASC
SELECT *
FROM `tblitem_tax`
WHERE `itemid` = '16'
---
    private function _getItems(int $proposalId): array
    {
        $items = $this->db->table('tblitemable')
            ->where('rel_id',   $proposalId)
            ->where('rel_type', 'proposal')
            ->orderBy('item_order', 'ASC')
            ->get()->getResultArray();

        // Attacher les taxes à chaque item
        foreach ($items as &$item) {
            $tax = $this->db->table('tblitem_tax')
                ->where('itemid', $item['id'])
                ->get()->getRowArray();

SELECT `tblproposals`.`id`, `tblproposals`.`subject`, `tblproposals`.`proposal_to`, `tblproposals`.`status`, `tblproposals`.`total`, `tblproposals`.`date`, `tblproposals`.`open_till`, `tblproposals`.`datecreated`, `tblproposals`.`currency`, `tblproposals`.`email`, `tblproposals`.`estimate_id`, `tblproposals`.`invoice_id`, `curr`.`symbol` AS `currency_symbol`, `curr`.`name` AS `currency_name`, `s`.`firstname` AS `staff_firstname`, `s`.`lastname` AS `staff_lastname`
FROM `tblproposals`
LEFT JOIN `tblcurrencies` `curr` ON `curr`.`id` = `tblproposals`.`currency`
LEFT JOIN `tblstaff` `s` ON `s`.`staffid` = `tblproposals`.`addedfrom`
WHERE `tblproposals`.`rel_id` = 4
AND `tblproposals`.`rel_type` = 'customer'
ORDER BY `tblproposals`.`id` DESC
---
    public function getByClient(int $clientId): array
    {
        return $this->select('
            tblproposals.id,
            tblproposals.subject,
            tblproposals.proposal_to,
            tblproposals.status,
            tblproposals.total,
            tblproposals.date,
            tblproposals.open_till,
            tblproposals.datecreated,
            tblproposals.currency,
            tblproposals.email,
            tblproposals.estimate_id,
            tblproposals.invoice_id,
            curr.symbol AS currency_symbol,
            curr.name   AS currency_name,
            s.firstname AS staff_firstname,
            s.lastname  AS staff_lastname
        ')
        ->join('tblcurrencies curr', 'curr.id = tblproposals.currency', 'left')
        ->join('tblstaff s',         's.staffid = tblproposals.addedfrom', 'left')
        ->where('tblproposals.rel_id',   $clientId)
        ->where('tblproposals.rel_type', 'customer')
        ->orderBy('tblproposals.id', 'DESC')
        ->findAll();